nxp-appcodehub/rd-nxp-easyevse-imxrt106x/EasyEVSE_FreeRTOS/RT1060/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSDHCPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: J2, peripheral: USDHC1, signal: 'usdhc_data, 3', pin_signal: GPIO_SD_B0_05, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: H2, peripheral: USDHC1, signal: 'usdhc_data, 2', pin_signal: GPIO_SD_B0_04, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: K1, peripheral: USDHC1, signal: 'usdhc_data, 1', pin_signal: GPIO_SD_B0_03, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: J1, peripheral: USDHC1, signal: 'usdhc_data, 0', pin_signal: GPIO_SD_B0_02, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: J4, peripheral: USDHC1, signal: usdhc_cmd, pin_signal: GPIO_SD_B0_00, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm, pull_keeper_select: Pull,
    pull_keeper_enable: Enable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_7, slew_rate: Fast}
  - {pin_num: J3, peripheral: USDHC1, signal: usdhc_clk, pin_signal: GPIO_SD_B0_01, hysteresis_enable: Disable, pull_up_down_config: Pull_Up_100K_Ohm, pull_keeper_select: Keeper,
    pull_keeper_enable: Disable, open_drain: Disable, speed: MHZ_100, drive_strength: R0_7, slew_rate: Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSDHCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSDHCPins(void) {
    CLOCK_EnableClock(kCLOCK_Iomuxc);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, /* GPIO_AD_B1_03 is configured as GPIO1_IO19 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_12_GPIO2_IO28, /* GPIO_B1_12 is configured as GPIO2_IO28 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_SetPinMux(IOMUXC_GPIO_B1_14_USDHC1_VSELECT, /* GPIO_B1_14 is configured as USDHC1_VSELECT */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_00_USDHC1_CMD, /* GPIO_SD_B0_00 is configured as USDHC1_CMD */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_01_USDHC1_CLK, /* GPIO_SD_B0_01 is configured as USDHC1_CLK */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0, /* GPIO_SD_B0_02 is configured as USDHC1_DATA0 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1, /* GPIO_SD_B0_03 is configured as USDHC1_DATA1 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2, /* GPIO_SD_B0_04 is configured as USDHC1_DATA2 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3, /* GPIO_SD_B0_05 is configured as USDHC1_DATA3 */
                     0U); /* Software Input On Field: Input Path is determined by functionality */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, /* GPIO_AD_B1_03 PAD functional properties : */
                        0x10B0U);                        /* Slew Rate Field: Slow Slew Rate
                                                            Drive Strength Field: R0/6
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Keeper
                                                            Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                            Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_12_GPIO2_IO28,    /* GPIO_B1_12 PAD functional properties : */
                        0x017089U);                      /* Slew Rate Field: Fast Slew Rate
                                                            Drive Strength Field: R0(150 Ohm @ 3.3V, 260 Ohm@1.8V)
                                                            Speed Field: medium(100MHz)
                                                            Open Drain Enable Field: Open Drain Disabled
                                                            Pull / Keep Enable Field: Pull/Keeper Enabled
                                                            Pull / Keep Select Field: Pull
                                                            Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                            Hyst. Enable Field: Hysteresis Enabled */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_B1_14_USDHC1_VSELECT, /* GPIO_B1_14 PAD functional properties : */
                        0x0170A1U);                       /* Slew Rate Field: Fast Slew Rate
                                                             Drive Strength Field: R0/4
                                                             Speed Field: medium(100MHz)
                                                             Open Drain Enable Field: Open Drain Disabled
                                                             Pull / Keep Enable Field: Pull/Keeper Enabled
                                                             Pull / Keep Select Field: Pull
                                                             Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                             Hyst. Enable Field: Hysteresis Enabled */

    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_00_USDHC1_CMD,   /* GPIO_SD_B0_00 PAD functional properties : */
                        0x0170A1U);                        /* Slew Rate Field: Fast Slew Rate
                                                              Drive Strength Field: R0/4
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Pull
                                                              Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                              Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_01_USDHC1_CLK,   /* GPIO_SD_B0_01 PAD functional properties : */
                        0x0140A1U);                        /* Slew Rate Field: Fast Slew Rate
                                                              Drive Strength Field: R0/4
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Disabled
                                                              Pull / Keep Select Field: Keeper
                                                              Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                              Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_02_USDHC1_DATA0, /* GPIO_SD_B0_02 PAD functional properties : */
                        0x0170A1U);                        /* Slew Rate Field: Fast Slew Rate
                                                              Drive Strength Field: R0/4
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Pull
                                                              Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                              Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_03_USDHC1_DATA1, /* GPIO_SD_B0_03 PAD functional properties : */
                        0x0170A1U);                        /* Slew Rate Field: Fast Slew Rate
                                                              Drive Strength Field: R0/4
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Pull
                                                              Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                              Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_04_USDHC1_DATA2, /* GPIO_SD_B0_04 PAD functional properties : */
                        0x0170A1U);                        /* Slew Rate Field: Fast Slew Rate
                                                              Drive Strength Field: R0/4
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Pull
                                                              Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                              Hyst. Enable Field: Hysteresis Enabled */
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_05_USDHC1_DATA3, /* GPIO_SD_B0_05 PAD functional properties : */
                        0x0170A1U);                        /* Slew Rate Field: Fast Slew Rate
                                                              Drive Strength Field: R0/4
                                                              Speed Field: medium(100MHz)
                                                              Open Drain Enable Field: Open Drain Disabled
                                                              Pull / Keep Enable Field: Pull/Keeper Enabled
                                                              Pull / Keep Select Field: Pull
                                                              Pull Up / Down Config. Field: 47K Ohm Pull Up
                                                              Hyst. Enable Field: Hysteresis Enabled */
}

